# Яночкин Александр ИУ7-15Б
# Решите квадратное уравнение по введенным коэффициентам


a, b, c = map(float, input('Введите коэффициенты квадратного уравнения "a b c": ').split())  # ввод аргументов

if a:  # a != 0
    d = b ** 2 - 4 * a * c  # дискриминант
    if d < 0:
        print("Нет решений")
    if d:  # d > 0
        x1 = (-b + d ** 0.5) / (2 * a)  # формула
        x2 = (-b - d ** 0.5) / (2 * a)
        print("Два решения")
        print(f"x1 = {x1:6.7g}\nx2 = {x2:6.7g}")
    else:  # d = 0
        x = -b / (2 * a)  # формула
        print("Одно решение")
        print(f"x = {x:6.7g}")
else:
    if b:  # a = 0, b != 0
        x = -c / b
        print("Одно решение")
        print(f"x = {x:6.7g}")
    else:
        if c:  # a = 0, b = 0, c != 0
            print("Нет решений")
        else:  # a = 0, b = 0, c = 0
            print("x - любое")
